app/controllers/school_classes_controller.rb

  def create
    @schoolclass = SchoolClass.new(schoolclass_params)
    #check validations
    @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Coding"], ["room_number", 11], ["created_at", "2019-05-20 19:53:03.113361"], ["updated_at", "2019-05-20 19:53:03.113361"]]

  def update
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(schoolclass_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-05-19 17:24:25.300502"], ["id", 1]]